# Το παρακάτω πρόγραμμα διαβάζει τους βαθμούς ενός μαθητή σε ένα μάθημα. Δέχεται δύο τιμές, μία για τη γραπτή και μία για την προφορική εξέταση, υπολογίζει τον Μ.Ο. (Μέσο Όρο), και εμφανίζει το εάν πέρασε ή όχι.
BASH_MATHIMATON = 10
mathima = input("Δώσε μάθημα")

# Ζητάει βαθμούς και κάνει έλεγχο ορθότητας τιμών. (Οι βαθμοί κυμαίνονται ανάμεσα του 0 και του 20).

bathmos_graptou = float(input("Τι βαθμό είχες στο γραπτό κομμάτι της εξετάσεως;"))
while bathmos_graptou < 0 or bathmos_graptou > 20:
    bathmos_graptou = float(input("Τι βαθμό είχες στο γραπτό κομμάτι της εξετάσεως; (Η τιμή πρέπει να κυμαίνεται μεταξύ 0 και 20)"))

bathmos_proforikou = float(input("Τι βαθμό είχες στο προφορικό κομμάτι της εξετάσεως;"))
while bathmos_proforikou < 0 or bathmos_proforikou > 20:
    bathmos_proforikou = float(input("Τι βαθμό είχες στο προφορικό κομμάτι της εξέτασεως; (Η τιμή πρέπει να κυμαίνεται μεταξύ 0 και 20)"))

# Υπολογισμός μέσου όρου και έλεγχος επιτυχίας

mesos_oros = (bathmos_graptou + bathmos_proforikou) / 2
print (f"Στο μάθημα: {mathima} ο Μ.Ο. σου είναι: {mesos_oros}")

if mesos_oros >= BASH_MATHIMATON:
    print("Εφόσον είναι παραπάνω του 10, περνάς!")
else:
    print("Δυστυχώς ο Μ.Ο. σου είναι μικρότερος της βάσης. Έμεινες!")